<h3>Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [37]:
import pandas as pd
data = [4,8,15,16,23,42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<h3>Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [38]:
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
my_series = pd.Series(my_list)

print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<h3>Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.
    
|Name   |Age|Gender |
|-------|---|-------|   
|Alice  |25 |Female |
|Bob    |30 |Male   |
|Claire |27 |Female |

In [39]:
data = { 'Name' : ['Alice','Bob','Claire'] , 'Age':[25,30,27], 'Gender' : ['Female', 'Male', 'Female']}
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<h3>Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

<h4>Answer:-
    
    A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or an SQL table. You can think of it as a collection of Series objects (one for each column) that share a common index. On the other hand, a Series is a 1-dimensional labeled array capable of holding any data type.

In [40]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [41]:
series = pd.Series([25, 30, 27], name='Age')
print(series)

0    25
1    30
2    27
Name: Age, dtype: int64

<h3>Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides many functions for manipulating data in a DataFrame. Some common functions include:

* head and tail: These functions return the first or last n rows of the DataFrame, respectively. They can be useful for quickly inspecting the data.

* describe: This function generates descriptive statistics of the DataFrame, including measures of central tendency and dispersion. It can be useful for getting a summary of the data.

* sort_values: This function sorts the DataFrame by one or more columns. It can be useful for arranging the data in a specific order.

* drop: This function drops specified rows or columns from the DataFrame. It can be useful for removing unnecessary data.

* fillna: This function fills missing values in the DataFrame with a specified value or using a specified method. It can be useful for handling missing data.

In [42]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [43]:
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [44]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [45]:
df.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [46]:
df.drop('Gender', axis=1)

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

<h3>Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

<h4>Answer:-
    
    All three of these Pandas data structures - Series, DataFrame, and Panel - are mutable in nature. This means that you can modify their contents after they have been created.

<h3>Q7. Create a DataFrame using multiple Series. Explain with an example.

In [47]:
import pandas as pd

s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])
s3 = pd.Series([7, 8, 9])

df = pd.DataFrame({'A': s1, 'B': s2, 'C': s3})

print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [48]:
type(df)

pandas.core.frame.DataFrame